---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue
source: html/54de7c5a-916a-291e-5b9c-08ebce5a8ab0.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue

This class represents values used by a particular demand factor definition. Each instance
 corresponds to a row in a table of values. These values are part of the ElectricalDemandFactorDefinition
 class.

## Syntax (C#)
```csharp
public class ElectricalDemandFactorValue : IDisposable
```